package org.mysudoku;

import java.util.ArrayList;
import java.util.List;

/**
 * 存放并获得关卡数据的类，因为设计的简单因此直接写在内存中。
 * 关卡较多时应该写入文件，从文件中读取数据
 *
 * @author Administrator
 */
public class Level {
    private static List<String[][]> levels;

    /**
     * 返回一个指定关卡的copy.
     *
     * @param level
     * @return
     */
    public static String[][] getLevel(int level) {
        String[][] lv = levels.get(level);
        String[][] l = new String[9][9];
        for (int i = 0; i < lv.length; i++) {
            for (int j = 0; j < lv[i].length; j++) {
                l[i][j] = lv[i][j];
            }
        }
        return l;
    }

    public static int getLevelNum() {
        return levels == null ? 0 : levels.size();
    }

    private final static String[][] level_1 = {
            {"9", "8", "1", "", "", "", "7", "", ""},// 1
            {"3", "", "7", "1", "", "9", "", "8", ""},// 2
            {"", "", "4", "", "8", "2", "", "", ""},// 3
            {"7", "", "", "6", "", "", "3", "9", ""},// 4
            {"2", "", "", "", "", "", "", "", "7"},// 5
            {"", "1", "3", "", "", "7", "", "", "5"},// 6
            {"", "", "", "3", "5", "", "2", "", ""},// 7
            {"", "6", "", "", "1", "4", "8", "", "3"},// 8
            {"", "", "2", "", "", "", "5", "6", "4"}, // 9
    };
    private final static String[][] level_2 = {
            {"1", "3", "", "8", "", "", "6", "", ""},// 1
            {"", "", "2", "", "", "7", "", "", ""},// 2
            {"", "", "", "1", "2", "", "", "7", "9"},// 3
            {"2", "8", "", "", "", "", "", "", ""},// 4
            {"", "9", "", "", "3", "", "", "1", ""},// 5
            {"", "", "", "", "", "", "", "2", "3"},// 6
            {"5", "7", "", "", "8", "3", "", "", ""},// 7
            {"", "", "", "7", "", "", "9", "", ""},// 8
            {"", "", "9", "", "", "2", "", "6", "7"}, // 9
    };
    private final static String[][] level_3 = {
            {"1", "", "", "", "", "8", "", "", "9"},// 1
            {"", "", "2", "", "", "", "", "", "8"},// 2
            {"", "8", "", "5", "4", "9", "", "", ""},// 3
            {"", "4", "", "2", "", "", "9", "", ""},// 4
            {"3", "", "9", "", "", "", "2", "", "1"},// 5
            {"", "", "1", "", "", "5", "", "4", ""},// 6
            {"", "", "", "9", "1", "2", "", "3", ""},// 7
            {"7", "", "", "", "", "", "1", "", ""},// 8
            {"2", "", "", "7", "", "", "", "", "6"}, // 9
    };

    static {
        levels = new ArrayList<>();
        levels.add(level_1);
        levels.add(level_2);
        levels.add(level_3);
    }
}
